In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

In [3]:
df = pd.DataFrame(dict1)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### 1. Display top 3 rows of the dataset

In [4]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

### 2. Check last 3 rows of the dataset

In [5]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### 3. Find shape of the dataset

In [6]:
print("No of rows:",df.shape[0])
print("No of columns:",df.shape[1])

No of rows: 7
No of columns: 3

### 4. Get information about our dataset

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

### 5. Check null values in the dataset

In [8]:
df.isna().sum()

Name      0
Marks     0
Gender    0
dtype: int64

### 6. Get overall statistics about the dataframe

In [9]:
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [10]:
df.describe(include="all")

          Name      Marks  Gender
count        7   7.000000       7
unique       7        NaN       2
top     Aadhya        NaN  Female
freq         1        NaN       4
mean       NaN  92.142857     NaN
std        NaN   6.491753     NaN
min        NaN  83.000000     NaN
25%        NaN  88.000000     NaN
50%        NaN  90.000000     NaN
75%        NaN  98.500000     NaN
max        NaN  99.000000     NaN

### 7. Find the unique values from the Gender column

In [11]:
df["Gender"].unique()

array(['Male', 'Female'], dtype=object)

### 8. Find the number of unique values from the Gender column

In [12]:
df["Gender"].nunique()

2

### 9. Display the count of unique values in Gender column

In [13]:
df["Gender"].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

### 10. Find total number of students having marks between 90 to 100 (inclusive) using between method

In [14]:
df[(df["Marks"]>=90) & (df["Marks"]<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [15]:
len(df[(df["Marks"]>=90) & (df["Marks"]<=100)])

4

In [16]:
df["Marks"].between(90,100).sum()

4

### 11. Average value of Marks

In [17]:
print("Average Value of Marks:",round(df["Marks"].mean(),2))

Average Value of Marks: 92.14

### 12. Apply method

In [18]:
sum = 0
def marks_by_2(x):
    return x/2
    
df["Marks"].apply(marks_by_2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [19]:
df["Half_Marks"] = df["Marks"].apply(marks_by_2)

In [20]:
df

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [21]:
df["Marks"].apply(lambda x: x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [22]:
df["Length_Name"] = df["Name"].apply(lambda x: len(x))

In [23]:
df

      Name  Marks  Gender  Half_Marks  Length_Name
0  Priyang     98    Male        49.0            7
1   Aadhya     89  Female        44.5            6
2   Krisha     99  Female        49.5            6
3   Vedant     87    Male        43.5            6
4   Parshv     90    Male        45.0            6
5   Mittal     83  Female        41.5            6
6  Archana     99  Female        49.5            7

### 13. Map Function

In [24]:
df

      Name  Marks  Gender  Half_Marks  Length_Name
0  Priyang     98    Male        49.0            7
1   Aadhya     89  Female        44.5            6
2   Krisha     99  Female        49.5            6
3   Vedant     87    Male        43.5            6
4   Parshv     90    Male        45.0            6
5   Mittal     83  Female        41.5            6
6  Archana     99  Female        49.5            7

In [25]:
df["Encoded_Gender"] = df["Gender"].map({"Male":1,"Female":0})

In [26]:
df

      Name  Marks  Gender  Half_Marks  Length_Name  Encoded_Gender
0  Priyang     98    Male        49.0            7               1
1   Aadhya     89  Female        44.5            6               0
2   Krisha     99  Female        49.5            6               0
3   Vedant     87    Male        43.5            6               1
4   Parshv     90    Male        45.0            6               1
5   Mittal     83  Female        41.5            6               0
6  Archana     99  Female        49.5            7               0

### 14. Drop columns

In [27]:
df.drop(["Half_Marks","Encoded_Gender","Length_Name"],axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [28]:
df.drop(["Half_Marks","Encoded_Gender","Length_Name"],axis=1,inplace=True)

In [29]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### 15. Print Name of the columns

In [30]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

### 16. Sort the dataframe as per the marks columns

In [31]:
df.sort_values("Marks")

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [32]:
df.sort_values("Marks",ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

### 17. Display the Name and Marks of the Female students

In [33]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [34]:
df[df["Gender"] == "Female"][["Name","Marks"]]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [35]:
df[df["Gender"].isin(["Female"])][["Name","Marks"]]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99